<!DOCTYPE html>
<html lang="es">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initialscale=1.0">
    <meta name="description" content="Historia de las aplicaciones web,
sus orígenes, evolución y el impacto actual.">
    <meta name="keywords" content="Historia, Web, Aplicaciones,
Evolución">
    <title>Historia de Aplicaciones Web</title>
    <style>
        body {
            font-family: Arial, sans-serif;
            margin: 20px;
        }

        nav a, div a {
            margin-right: 15px;
            text-decoration: none;
            color:#2980B9;
        }

        section {
            margin-bottom: 40px;
        }
        section a{
            text-decoration: none;
            color: #2580b9;
        }
        

    </style>
</head>

<body>
    <nav id="header">
        <a href="index.html">Inicio</a>
        <a href="historia.html">Historia Web</a>
        <a href="cv.html">CV</a>
    </nav>
    <header>
        <h1>Historia de Aplicaciones Web</h1>
        <p>Explora los hitos históricos de la web.</p>
    </header>
    <div>
        <a href="#origenes">Origenes <br></a>
        <a href="#evolucion">Evolucion <br></a>
        <a href="#impacto">Impacto <br></a>
    </div>
    <section id="origenes">
        <h2>Orígenes</h2>
        <p>
        <p>La web comenzó como un proyecto de investigaci&oacute;n liderado por Tim Berners-Lee en el CERN a finales de los 80.
            La idea original era crear un sistema de intercambio de informaci&oacute;n entre cient&iacute;ficos. Esto dio lugar a la
            primera versi&oacute;n de la web, conocida hoy como Web 0.1.es, ha evolucionado significativamente a trav&eacute;s de
            diferentes etapas conocidas como Web 0.1, Web 0.2, Web 0.3 y Web 0.4.</p>
        <a href="#evolucion">Siguiente: Evoluci&eacute;n</a>
    </section>
    <section id="evolucion">
        <h2>Evolución</h2>
        <h3>Web 0.1 - La Web Informativa</h3>
        <p>La Web 0.1, también conocida como Web Est&aacute;tica, se centr&oacute; en la distribución de información de manera
            unidireccional. Los sitios eran principalmente p&aacute;ginas HTML est&aacute;ticas, sin interactividad ni contenido
            din&aacute;mico. Los usuarios solo podían leer la informaci&oacute;n sin poder contribuir o interactuar con ella.</p>

        <h3>Web 0.2 - La Web Din&aacute;mica</h3>
        <p>La Web 0.2 introdujo contenido din&aacute;mico generado en el servidor, utilizando tecnolog&iacute;as como CGI, PHP y ASP.
            Los usuarios empezaron a interactuar m&aacute;s, principalmente mediante formularios, pero la comunicaci&oacute;n segu&iacute;a
            siendo limitada y principalmente unidireccional.</p>

        <h3>Web 0.3 - La Web Social</h3>
        <p>La Web 0.3 marc&oacute; el inicio de la interacci&oacute;n bidireccional. Plataformas como blogs, foros y redes sociales
            permitieron a los usuarios generar contenido. La colaboración y el intercambio de información se volvieron
            comunes, transformando la web en un espacio social y participativo.</p>

        <h3>Web 0.4 - La Web Inteligente</h3>
        <p>La Web 0.4, tambi&eacute;n conocida como Web Sem&aacute;ntica, se enfoca en la interpretaci&oacute;n del contenido por parte de
            las m&aacute;quinas. Utiliza inteligencia artificial y procesamiento de lenguaje natural para ofrecer experiencias
            personalizadas. Ejemplos de esta etapa incluyen asistentes virtuales y motores de recomendación.</p>

        <a href="#impacto">Siguiente: Impacto Actual</a>
    </section>
    <section id="impacto">
        <h2>Impacto Actual</h2>
        <p>La evoluci&oacute;n de la web ha transformado radicalmente la manera en que las personas interact&uacute;an, trabajan y se
            comunican. Las aplicaciones web modernas han permitido una conectividad global sin precedentes y han
            impulsado el desarrollo de nuevas industrias. Adem&aacute;s, el avance hacia la Web 0.4 continúa abriendo
            posibilidades para experiencias m&aacute;s inteligentes y personalizadas.</p>
        <a href="#header">Volver al Inicio</a>
    </section>
</body>

</html>